perftests/smol-run1.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0017 secs
  Slowest:	0.1167 secs
  Fastest:	0.0000 secs
  Average:	0.0106 secs
  Requests/sec:	18947.2857
  
  Total data:	21598440 bytes
  Size/request:	38 bytes

Response time histogram:
  0.000 [1]	|
  0.012 [333028]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [202818]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [23749]	|■■■
  0.047 [6454]	|■
  0.058 [1697]	|
  0.070 [437]	|
  0.082 [133]	|
  0.093 [46]	|
  0.105 [13]	|
  0.117 [4]	|


Latency distribution:
  10% in 0.0016 secs
  25% in 0.0030 secs
  50% in 0.0102 secs
  75% in 0.0146 secs
  90% in 0.0197 secs
  95% in 0.0244 secs
  99% in 0.0390 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1167 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0289 secs
  resp wait:	0.0103 secs, 0.0000 secs, 0.1166 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0408 secs

Status code distribution:
  [200]	568380 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57184->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57186->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57187->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57188->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57189->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57190->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57191->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57192->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57193->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57194->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57195->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57196->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57197->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57198->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57199->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57200->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57201->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57202->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57203->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57204->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57205->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57206->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57207->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57208->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57209->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57210->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57211->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57212->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57213->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57214->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57215->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57216->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57217->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57218->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57219->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57220->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57221->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57222->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57223->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57224->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57225->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57226->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57227->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57228->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57229->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57230->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57231->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57232->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57233->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57234->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57235->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57236->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57237->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57238->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57239->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57240->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57241->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57242->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57243->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57244->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57245->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57246->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57247->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57248->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57249->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57250->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57251->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57252->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57253->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57254->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57256->[::1]:9000: read: connection reset by peer