perftests/smol-run2.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0071 secs
  Slowest:	0.1303 secs
  Fastest:	0.0000 secs
  Average:	0.0060 secs
  Requests/sec:	41612.6946
  
  Total data:	47448206 bytes
  Size/request:	47 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [915468]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [62703]	|■■■
  0.039 [14310]	|■
  0.052 [4818]	|
  0.065 [1725]	|
  0.078 [619]	|
  0.091 [217]	|
  0.104 [95]	|
  0.117 [31]	|
  0.130 [13]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0014 secs
  50% in 0.0021 secs
  75% in 0.0041 secs
  90% in 0.0113 secs
  95% in 0.0182 secs
  99% in 0.0354 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1303 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0381 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0540 secs
  resp wait:	0.0058 secs, 0.0000 secs, 0.1303 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0546 secs

Status code distribution:
  [200]	1000000 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61352->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61354->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61355->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61356->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61357->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61358->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61361->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61362->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61363->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61364->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61367->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61368->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61369->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61371->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61431->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61432->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61433->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61444->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61445->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61455->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61459->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61463->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61468->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61469->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61472->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61473->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61474->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61475->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61476->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61477->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61478->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61479->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61480->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61481->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61482->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61483->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61484->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61485->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61486->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:61487->127.0.0.1:9000: read: connection reset by peer